Repository: gbramoura/fishspot-api
Catalog: src/FishSpotApi.Domain/Resources/FishSpotResource.*.resx
Languages: pt_br

# unauthorized
source: Don't authorized
pt_br: Não autorizado

# email_in_use
source: E-mail already in use
pt_br: Email já em uso

# user_register_successfully
source: User registered successfully
pt_br: Usuário registrado com sucesso

source: Internal server error
pt_br: Erro interno do servidor

# user_authenticated
source: User was correctly authenticated.
pt_br: Usuário corretamente autenticado

source: Is authenticated
pt_br: Autenticado

source: Token refreshed
pt_br: Token atualizado

# token_email_sent
source: A validation token was sent to your e-mail
pt_br: Um token para validação foi enviado para o email

# token_valid
source: The token is valid
pt_br: O token é valido

# token_invalid
source: The token is invalid
pt_br: O token não é valido

# password_changed
source: Password changed successfully
pt_br: Senha alterada com sucesso

# resource_attached
source: The resources were attached to a spot
pt_br: O recurso foi anexado ao ponto

# resource_detached
source: The resources were detached to a spot
pt_br: O recurso foi desanexado do ponto

source: Spot registered successfully
pt_br: Ponto registrado com sucesso

source: Spot find
pt_br: Ponto encontrado

# spot_location_find
source: Locations find
pt_br: Localizações de pontos encontrados

source: Spot updated successfully
pt_br: Ponto alterado com sucesso

source: Spot deleted successfully
pt_br: Ponto removido com sucesso

source: User not found
pt_br: Usuário não encontrado

# user_password_incorrect
source: Password is not correct
pt_br: A senha não esta correta

# token_refresh_invalid
source: Invalid refresh token
pt_br: Token para atualizar é invalido

source: Spot not found
pt_br: Ponto não encontrado

# user_not_authorized_to_update_spot
source: User is not authorized to update spot
pt_br: Usuário não é autorizado para atualizar o ponto

# user_not_authorized_to_delete_spot
source: User is not authorized to delete spot
pt_br: Usuário não é autorizado a deletar o ponto

source: Resource not found
pt_br: Recurso não encontrado

# resource_unable_to_save
source: Unable to save files
pt_br: Não foi possivel salvar os arquivos

# resource_unable_to_detach
source: An error was caught when tried to detach the resources
pt_br: Um erro foi encontrado enquanto tentava desanexar os arquivos

source: Token not found
pt_br: Token não encontrado

# mail_title
source: Verification Code
pt_br: Codigo de Verificação

# mail_description
source: The FishSpot receive a request to use this email to change the password
pt_br: O FishSpot recebeu uma requisição para usar este email para alterar a senha do usuário

# mail_code_description
source: Use this code to change your password
pt_br: Use esse codigo para mudar a sua senha

# mail_warning_description
source: If you do not recognize this account in the FishSpot system or did not request a password change, someone may be impersonating you
pt_br: Se você não reconhece esta conta no FishSpot ou não solicitou uma alteração de senha, alguém pode estar se passando por você

# mail_subject
source: Password Recover
pt_br: Recuperação de Senha

# resource_file_allowed
source: Only {0} are allowed.
pt_br: Apenas arquivos com extensão {0} são permitidos

# resource_file_not_found
source: File {0} not found
pt_br: Arquivo {0} não encontrado

# annotation_password_required
source: The password must be filled
pt_br: A senha deve ser preenchida

# annotation_password_min_length
source: The password must have more than 8 characters
pt_br: A senha deve ter mais de 8 caracteres

# annotation_email_required
source: The e-mail must be filled
pt_br: O e-mail deve ser preenchido

# annotation_email_validation
source: E-mail it not valid
pt_br: O e-mail não é válido

# annotation_email_max_length
source: The limit of characters 245 has been reached
pt_br: O limite de 245 caracteres foi atingido

# annotation_name_required
source: The field name must be filled
pt_br: O campo nome deve ser preenchido

# annotation_name_max_length
source: The limit of characters 245 has been reached
pt_br: O limite de 245 caracteres foi atingido

# annotation_token_required
source: The token must be filled
pt_br: O token deve ser preenchido

# annotation_refresh_token_required
source: The refresh token must be filled
pt_br: O refresh token deve ser preenchido

# annotation_token_max_length
source: The limit of characters 5 has been reached
pt_br: O limite de 5 caracteres foi atingido

# annotation_page_size_required
source: The page size is required
pt_br: O tamanho da página é obrigatório

# annotation_page_size_range
source: The page size must be higher than 0
pt_br: O tamanho da página deve ser maior que 0

# annotation_page_number_required
source: The page number is required
pt_br: O número da página é obrigatório

# annotation_page_number_range
source: The page number must be higher than 0
pt_br: O número da página deve ser maior que 0

# annotation_spot_required
source: The spot unique identifier must be filled
pt_br: O identificador único do local deve ser preenchido

# annotation_files_required
source: The list with file must be filled
pt_br: A lista de arquivos deve ser preenchida

# annotation_files_min_length
source: The minimum number of file id must be at least one
pt_br: O número mínimo de IDs de arquivo deve ser de pelo menos um

# annotation_new_password_required
source: The new password should be filled
pt_br: A nova senha deve ser preenchida

# annotation_files_max_length
source: The limit of 30 files has been reached
pt_br: O limite de 30 arquivos foi atingido

# annotation_title_required
source: The title must be filled
pt_br: O título deve ser preenchido

# annotation_observation_max_length
source: The limit of characters 245 has been reached
pt_br: O limite de 245 caracteres foi atingido

# annotation_coordinates_required
source: The coordinates must be filled
pt_br: As coordenadas devem ser preenchidas

# annotation_coordinates_max_length
source: The coordinates must be at most 2 characters long
pt_br: As coordenadas devem ter no máximo 2 caracteres

# annotation_coordinates_min_length
source: The coordinates must be at least 2 characters long
pt_br: As coordenadas devem ter pelo menos 2 caracteres

# annotation_fishs_min_length
source: Minimum length of fishes required
pt_br: Comprimento mínimo de peixes obrigatório

# annotation_rate_required
source: The location difficulty rate must be filled
pt_br: A taxa de dificuldade do local deve ser preenchida

# annotation_risk_required
source: The location risk rate must be filled
pt_br: A taxa de risco do local deve ser preenchida

# annotation_weight_required
source: The weight must be filled
pt_br: O peso deve ser preenchido

# annotation_unit_measure_required
source: The unit measure must be filled
pt_br: A unidade de medida deve ser preenchida

# annotation_lures_min_length
source: The minimum number of lures must be at least one
pt_br: O número mínimo de iscas deve ser de pelo menos um

# annotation_lures_max_length
source: The limit of lures has been reached
pt_br: O limite de iscas foi atingido
